<a href="https://colab.research.google.com/github/YuDeokRin/ICT_innovation_square/blob/main/2020%EB%85%84_9%EC%9B%94_16%EC%9D%BC_%EC%8B%A4%EC%8A%B5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
exam_data = {
    "수학":[90,80],
    "영어":[98,89],
    "음악":[85,95],
    "체육":[100,90]
}

In [ ]:
pd.DataFrame(exam_data)

   수학  영어  음악   체육
0  90  98  85  100
1  80  89  95   90

In [ ]:
pd.DataFrame(exam_data,index=["서준","우현"])

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [ ]:
df=pd.DataFrame(exam_data,index=["서준","우현"])
df

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [ ]:
#같은 데이터를 공유
df4 = df

In [ ]:
#id 함수의 리턴값이 같으면 같은 데이터를 공유
id(df)

140541203474248

In [ ]:
id(df4)

140541203474248

In [ ]:
#각자 자기 밥드릇에 숫가락 놓기 -> 따로 
df4 = df[:]

In [ ]:
id(df)

140541203474248

In [ ]:
id(df4)

140541169376000

In [ ]:
df4

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [ ]:
df4.drop("수학",axis=1, inplace=True)

/usr/local/lib/python3.6/dist-packages/pandas/core/frame.py:3997: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [ ]:
df4

    영어  음악   체육
서준  98  85  100
우현  89  95   90

In [ ]:

#df4.drop(["영어","체육"],axis=2,inplace=True)  #2개 이상일때는 []리스트 사용

In [ ]:
df4

    영어  음악   체육
서준  98  85  100
우현  89  95   90

강의 자료 25페이지 loc, iloc 이용해서 줄 추출

In [ ]:
exam_data = {
    "수학":[90,80, 70],
    "영어":[98,89, 95],
    "음악":[85,95, 100],
    "체육":[100,90,90]
}

In [ ]:
df = pd.DataFrame(exam_data,index=["서준","우현","인아"])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
df.loc["서준"]

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [ ]:
label1=df.loc["서준"]

In [ ]:
label1

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [ ]:
df.iloc[0]

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [ ]:
df.iloc[1]

수학    80
영어    89
음악    95
체육    90
Name: 우현, dtype: int64

In [ ]:
df.iloc[2]

수학     70
영어     95
음악    100
체육     90
Name: 인아, dtype: int64

In [ ]:
#데이터 프레임의 줄수
len(df)

3

In [ ]:
#0이상 3미만의 정수
range(3)

range(0, 3)

In [ ]:
#0이상 3미만의 정수 => 출력 0, 1, 2
list(range(3))

[0, 1, 2]

In [ ]:
for index in range(3):
  print("index=", index)
  print(df.iloc[index])
  print("="*100)

index= 0
수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64
====================================================================================================
index= 1
수학    80
영어    89
음악    95
체육    90
Name: 우현, dtype: int64
====================================================================================================
index= 2
수학     70
영어     95
음악    100
체육     90
Name: 인아, dtype: int64
====================================================================================================

In [ ]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

loc, iloc 이용여러줄 조회

In [ ]:
df.loc[["서준","인아"]]

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [ ]:
df.iloc[[0,2]]

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [ ]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
#서준 줄 이상  인아 줄 이하
df.loc["서준":"인아"]

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
#0번째 줄 이상 2번째 줄 미만(2번째 줄 포함 안함)
df.iloc[0:2]

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [ ]:
#0번째 줄 이상 3번째 줄 미만(2번째 줄 까지)
df.iloc[0:3]

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
df["수학"] # 시리즈 타입

서준    90
우현    80
인아    70
Name: 수학, dtype: int64

In [ ]:
df.수학 #칸 하나 : seriese 타입

서준    90
우현    80
인아    70
Name: 수학, dtype: int64

In [ ]:
df[["수학","음악"]] # 칸 두개 : dataFrame타입 , 두개 부터는 []리스트 사용

    수학   음악
서준  90   85
우현  80   95
인아  70  100

In [ ]:
df[["수학"]] # []를 넣어주면 seriese타입이아니고 Data Frame타입이다.

    수학
서준  90
우현  80
인아  70

특정 칸의 데이터로 인덱스 설정

In [ ]:
exam_data = {
    "이름":["서준","우현","인아"],
    "수학":[90, 80, 70],
    "영어":[98,89, 95],
    "음악":[85, 95, 100],
    "체육":[100,90, 90]
}

In [ ]:
df = pd.DataFrame(exam_data)

In [ ]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [ ]:
#특정 칸에 저장된 데이터로 인덱스 설정

df.set_index("이름", inplace=True) # 이름 칸에 저장된 데이터로 인덱스 설정

KeyError: ignored

In [ ]:
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

서준의 음악 점수 조회

In [ ]:
#loc["줄이름","칸이름"]
df.loc["서준","음악"]

85

In [ ]:
#iloc[줄인덱스, 칸인덱스]
df.iloc[0, 2]

100

In [ ]:
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

여러개 데이터 선택

In [ ]:
df.iloc[2, 0:4]

수학     70
영어     95
음악    100
체육     90
Name: 인아, dtype: int64

In [ ]:
df.loc["인아", "영어":"체육"]

영어     95
음악    100
체육     90
Name: 인아, dtype: int64

In [ ]:
df.loc["인아", ["영어","체육"]]

영어    95
체육    90
Name: 인아, dtype: int64

In [ ]:
df.iloc[2,  [1,3]]

영어    95
체육    90
Name: 인아, dtype: int64

여러줄 여러칸 조회

In [ ]:
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
df.iloc[ 0: 2 , 1:4 ]

    영어  음악   체육
이름
서준  98  85  100
우현  89  95   90

In [ ]:
df.iloc[ 0: 2 , 1: ]

    영어  음악   체육
이름
서준  98  85  100
우현  89  95   90

In [ ]:
df.loc["서준":"우현", "영어":"체육"]

    영어  음악   체육
이름
서준  98  85  100
우현  89  95   90

In [ ]:
df.loc[ ["서준","인아"], ["영어","체육"]]

    영어   체육
이름
서준  98  100
인아  95   90

In [ ]:
df.iloc[[0,2], [1,3]]

    영어   체육
이름
서준  98  100
인아  95   90

In [ ]:
df.loc[ ["인아"], ["영어","체육"]]

    영어  체육
이름
인아  95  90

합계 칸 추가

In [ ]:
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
df["합계"]=0

In [ ]:
df

    수학  영어   음악   체육  합계
이름
서준  90  98   85  100   0
우현  80  89   95   90   0
인아  70  95  100   90   0

In [ ]:
df.iloc[0, 0:4]

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [ ]:
df.iloc[0, 0:4].sum()

373

In [ ]:
df.iloc[0,4] #테이블에 위치

0

In [ ]:
df.iloc[0,4] = df.iloc[0, 0:4].sum()

In [ ]:
df

    수학  영어   음악   체육   합계
이름
서준  90  98   85  100  373
우현  80  89   95   90    0
인아  70  95  100   90    0

우현 줄의 수학 영어 음악 체육 조회

In [ ]:
df.iloc[1, 0:4]

수학    80
영어    89
음악    95
체육    90
Name: 우현, dtype: int64

In [ ]:
df.iloc[1, 0:4].sum()

354

In [ ]:
df.iloc[1,4]=df.iloc[1, 0:4].sum()

In [ ]:
df

    수학  영어   음악   체육   합계
이름
서준  90  98   85  100  373
우현  80  89   95   90  354
인아  70  95  100   90    0

합계 칸을 0으로 초기화

In [ ]:
df["합계"]=0

In [ ]:
df

    수학  영어   음악   체육  합계
이름
서준  90  98   85  100   0
우현  80  89   95   90   0
인아  70  95  100   90   0

In [ ]:
for index in range(3):
  print("index=", index)
  print("점수 합계", df.iloc[index,0:4].sum())
  df.iloc[index, 4] = df.iloc[index, 0:4].sum()

index= 0
점수 합계 373
index= 1
점수 합계 354
index= 2
점수 합계 355

In [ ]:
df

    수학  영어   음악   체육   합계
이름
서준  90  98   85  100  373
우현  80  89   95   90  354
인아  70  95  100   90  355
3    0   0    0    0    0

줄 추가

In [ ]:
df.loc["덕린"]=0

In [ ]:
df

    수학  영어   음악   체육   합계
이름
서준  90  98   85  100  373
우현  80  89   95   90  354
인아  70  95  100   90  355
3    0   0    0    0    0
덕린   0   0    0    0    0

In [ ]:
df.loc[4]=[100, 90, 80, 40, 0]

In [ ]:
df

     수학  영어   음악   체육   합계
이름
서준   90  98   85  100  373
우현   80  89   95   90  354
인아   70  95  100   90  355
3     0   0    0    0    0
덕린    0   0    0    0    0
4   100  90   80   40    0

In [ ]:
df.loc[3,"영어"] = 200
df.loc["덕린","영어"] = 100

In [ ]:
df

     수학   영어   음악   체육   합계
이름
서준   90   98   85  100  373
우현   80   89   95   90  354
인아   70   95  100   90  355
3     0  200    0    0    0
덕린    0  100    0    0    0
4   100   90   80   40    0

In [ ]:
df.iloc[3, 4] =300
df.iloc[4, 4] = 400

In [ ]:
df

     수학   영어   음악   체육   합계
이름
서준   90   98   85  100  373
우현   80   89   95   90  354
인아   70   95  100   90  355
3     0  200    0    0  300
덕린    0  100    0    0  400
4   100   90   80   40    0

여러개의  칸을 한꺼번에 수정

In [ ]:
df.loc["서준",["음악","체육"]] = 50

In [ ]:
df

     수학   영어   음악  체육   합계
이름
서준   90   98   50  50  373
우현   80   89   95  90  354
인아   70   95  100  90  355
3     0  200    0   0  300
덕린    0  100    0   0  400
4   100   90   80  40    0

In [ ]:
df.loc["서준",["음악","체육"]] = [100, 50]

In [ ]:
df

     수학   영어   음악  체육   합계
이름
서준   90   98  100  50  373
우현   80   89   95  90  354
인아   70   95  100  90  355
3     0  200    0   0  300
덕린    0  100    0   0  400
4   100   90   80  40    0